; domain
(define (domain barman)
  (:requirements :strips :typing )
  (:types hand level beverage dispenser container - object
  	  ingredient cocktail - beverage
          shot shaker - container)
  (:predicates  (ontable ?c - container)
                (holding ?h - hand ?c - container)
		(handempty ?h - hand)
		(empty ?c - container)
                (contains ?c - container ?b - beverage)
		(clean ?c - container)
                (used ?c - container ?b - beverage)
                (dispenses ?d - dispenser ?i - ingredient)
		(shaker-empty-level ?s - shaker ?l - level)
		(shaker-level ?s - shaker ?l - level)
		(next ?l1 ?l2 - level)
		(unshaked ?s - shaker)
		(shaked ?s - shaker)
                (cocktail-part1 ?c - cocktail ?i - ingredient)
                (cocktail-part2 ?c - cocktail ?i - ingredient))


  (:action grasp
             :parameters
             (?h - hand
             ?c - container)
             :precondition
             (and (ontable ?c) (handempty ?h))
             :effect
             (and (not (ontable ?c))
	     	     	  (not (handempty ?h))
			  (holding ?h ?c)
			  ))
  (:action leave
             :parameters
             (?h - hand
             ?c - container)
             :precondition
             (holding ?h ?c)
             :effect
             (and (not (holding ?h ?c))
	     	     	  (handempty ?h)
			  (ontable ?c)
			  ))
  (:action fill-shot
           :parameters
           (?s - shot
           ?i - ingredient
           ?h1 - hand
           ?h2 - hand
           ?d - dispenser)
           :precondition
           (and (holding ?h1 ?s)
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (clean ?s))
           :effect
           (and (not (empty ?s))
	   	   	(contains ?s ?i)
	   	   	(not (clean ?s))
			(used ?s ?i)
			))


  (:action refill-shot
           :parameters
           (?s - shot
           ?i - ingredient
           ?h1 - hand
           ?h2 - hand
           ?d - dispenser)
           :precondition
           (and (holding ?h1 ?s)
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (used ?s ?i))
           :effect
           (and (not (empty ?s))
                        (contains ?s ?i)
			))

  (:action empty-shot
           :parameters
           (?h - hand
           ?p - shot
            ?b - beverage)
           :precondition
           (and (holding ?h ?p)
                              (contains ?p ?b))
           :effect
           (and (not (contains ?p ?b))
	   	   	(empty ?p)
			))

  (:action clean-shot
  	   :parameters
  	   (?s - shot
  	   ?b - beverage
  	   ?h1 - hand
  	   ?h2 - hand)
           :precondition
           (and (holding ?h1 ?s)
                              (handempty ?h2)
			      (empty ?s)
                              (used ?s ?b))
           :effect
           (and (not (used ?s ?b))
	   	   	(clean ?s)
			))

  (:action pour-shot-to-clean-shaker
           :parameters
           (?s - shot
           ?i - ingredient
           ?d - shaker
           ?h1 - hand
           ?l - level
           ?l1 - level)
           :precondition
           (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (empty ?d)
	   		      (clean ?d)
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect
           (and (not (contains ?s ?i))
	   	   	(empty ?s)
			(contains ?d ?i)
                        (not (empty ?d))
			(not (clean ?d))
			(unshaked ?d)
			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)
			))


  (:action pour-shot-to-used-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (unshaked ?d)
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
                        (contains ?d ?i)
	   	   	(empty ?s)
  			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)
			))

  (:action empty-shaker
           :parameters (?h - hand ?s - shaker ?b - cocktail ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
                              (contains ?s ?b)
			      (shaked ?s)
			      (shaker-level ?s ?l)
			      (shaker-empty-level ?s ?l1))
           :effect (and (not (shaked ?s))
	   	   	(not (shaker-level ?s ?l))
	   	   	(shaker-level ?s ?l1)
			(not (contains ?s ?b))
	   	   	(empty ?s)
			))

  (:action clean-shaker
  	   :parameters (?h1 ?h2 - hand ?s - shaker)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
                              (empty ?s))
           :effect (and (clean ?s)
			))

  (:action shake
  	   :parameters (?b - cocktail ?d1 ?d2 - ingredient ?s - shaker ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
			      (contains ?s ?d1)
                              (contains ?s ?d2)
                              (cocktail-part1 ?b ?d1)
			      (cocktail-part2 ?b ?d2)
			      (unshaked ?s))
           :effect (and (not (unshaked ?s))
		        (not (contains ?s ?d1))
                        (not (contains ?s ?d2))
	   	   	(shaked ?s)
                        (contains ?s ?b)
			))

  (:action pour-shaker-to-shot
           :parameters (?b - beverage ?d - shot ?h - hand ?s - shaker ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
			      (shaked ?s)
			      (empty ?d)
			      (clean ?d)
			      (contains ?s ?b)
                              (shaker-level ?s ?l)
                              (next ?l1 ?l))
           :effect (and (not (clean ?d))
	   	   	(not (empty ?d))
			(contains ?d ?b)
			(shaker-level ?s ?l1)
			(not (shaker-level ?s ?l))
			)))

; problem
(define (problem prob)
 (:domain barman)
 (:objects 
      shaker1 - shaker
      left right - hand
      shot1 shot2 shot3 shot4 shot5 shot6 shot7 shot8 shot9 shot10 - shot
      ingredient1 ingredient2 ingredient3 ingredient4 ingredient5 ingredient6 ingredient7 ingredient8 ingredient9 ingredient10 ingredient11 ingredient12 ingredient13 ingredient14 ingredient15 ingredient16 ingredient17 ingredient18 ingredient19 ingredient20 - ingredient
      cocktail1 cocktail2 cocktail3 cocktail4 cocktail5 cocktail6 cocktail7 cocktail8 cocktail9 cocktail10 - cocktail
      dispenser1 dispenser2 dispenser3 dispenser4 dispenser5 dispenser6 dispenser7 dispenser8 dispenser9 dispenser10 dispenser11 dispenser12 dispenser13 dispenser14 dispenser15 dispenser16 dispenser17 dispenser18 dispenser19 dispenser20 - dispenser
      l0 l1 l2 - level
)
 (:init 
  (ontable shaker1)
  (ontable shot1)
  (ontable shot2)
  (ontable shot3)
  (ontable shot4)
  (ontable shot5)
  (ontable shot6)
  (ontable shot7)
  (ontable shot8)
  (ontable shot9)
  (ontable shot10)
  (dispenses dispenser1 ingredient1)
  (dispenses dispenser2 ingredient2)
  (dispenses dispenser3 ingredient3)
  (dispenses dispenser4 ingredient4)
  (dispenses dispenser5 ingredient5)
  (dispenses dispenser6 ingredient6)
  (dispenses dispenser7 ingredient7)
  (dispenses dispenser8 ingredient8)
  (dispenses dispenser9 ingredient9)
  (dispenses dispenser10 ingredient10)
  (dispenses dispenser11 ingredient11)
  (dispenses dispenser12 ingredient12)
  (dispenses dispenser13 ingredient13)
  (dispenses dispenser14 ingredient14)
  (dispenses dispenser15 ingredient15)
  (dispenses dispenser16 ingredient16)
  (dispenses dispenser17 ingredient17)
  (dispenses dispenser18 ingredient18)
  (dispenses dispenser19 ingredient19)
  (dispenses dispenser20 ingredient20)
  (clean shaker1)
  (clean shot1)
  (clean shot2)
  (clean shot3)
  (clean shot4)
  (clean shot5)
  (clean shot6)
  (clean shot7)
  (clean shot8)
  (clean shot9)
  (clean shot10)
  (empty shaker1)
  (empty shot1)
  (empty shot2)
  (empty shot3)
  (empty shot4)
  (empty shot5)
  (empty shot6)
  (empty shot7)
  (empty shot8)
  (empty shot9)
  (empty shot10)
  (handempty left)
  (handempty right)
  (shaker-empty-level shaker1 l0)
  (shaker-level shaker1 l0)
  (next l0 l1)
  (next l1 l2)
  (cocktail-part1 cocktail1 ingredient14)
  (cocktail-part2 cocktail1 ingredient11)
  (cocktail-part1 cocktail2 ingredient12)
  (cocktail-part2 cocktail2 ingredient17)
  (cocktail-part1 cocktail3 ingredient18)
  (cocktail-part2 cocktail3 ingredient9)
  (cocktail-part1 cocktail4 ingredient7)
  (cocktail-part2 cocktail4 ingredient10)
  (cocktail-part1 cocktail5 ingredient4)
  (cocktail-part2 cocktail5 ingredient12)
  (cocktail-part1 cocktail6 ingredient4)
  (cocktail-part2 cocktail6 ingredient12)
  (cocktail-part1 cocktail7 ingredient12)
  (cocktail-part2 cocktail7 ingredient15)
  (cocktail-part1 cocktail8 ingredient5)
  (cocktail-part2 cocktail8 ingredient4)
  (cocktail-part1 cocktail9 ingredient10)
  (cocktail-part2 cocktail9 ingredient2)
  (cocktail-part1 cocktail10 ingredient2)
  (cocktail-part2 cocktail10 ingredient3)
)
 (:goal
(and 
(contains shot1 cocktail1 ) 
)))

; plan
1. (grasp left shot7)
   deleted: (ontable shot7) (handempty left)
   added: (holding left shot7)
   goals met: 0 of 1
2. (fill-shot shot7 ingredient11 left right dispenser11)
   deleted: (empty shot7) (clean shot7)
   added: (contains shot7 ingredient11) (used shot7 ingredient11)
   goals met: 0 of 1
3. (leave left shot7)
   deleted: (holding left shot7)
   added: (handempty left) (ontable shot7)
   goals met: 0 of 1
4. (grasp right shot1)
   deleted: (ontable shot1) (handempty right)
   added: (holding right shot1)
   goals met: 0 of 1
5. (fill-shot shot1 ingredient14 right left dispenser14)
   deleted: (empty shot1) (clean shot1)
   added: (contains shot1 ingredient14) (used shot1 ingredient14)
   goals met: 0 of 1
6. (pour-shot-to-clean-shaker shot1 ingredient14 shaker1 right l0 l1)
   deleted: (contains shot1 ingredient14) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot1) (contains shaker1 ingredient14) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 0 of 1
7. (clean-shot shot1 ingredient14 right left)
   deleted: (used shot1 ingredient14)
   added: (clean shot1)
   goals met: 0 of 1
8. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 0 of 1
9. (leave right shot1)
   deleted: (holding right shot1)
   added: (handempty right) (ontable shot1)
   goals met: 0 of 1
10. (grasp right shot7)
   deleted: (ontable shot7) (handempty right)
   added: (holding right shot7)
   goals met: 0 of 1
11. (pour-shot-to-used-shaker shot7 ingredient11 shaker1 right l1 l2)
   deleted: (contains shot7 ingredient11) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient11) (empty shot7) (shaker-level shaker1 l2)
   goals met: 0 of 1
12. (leave right shot7)
   deleted: (holding right shot7)
   added: (handempty right) (ontable shot7)
   goals met: 0 of 1
13. (shake cocktail1 ingredient14 ingredient11 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient14) (contains shaker1 ingredient11)
   added: (shaked shaker1) (contains shaker1 cocktail1)
   goals met: 0 of 1
14. (pour-shaker-to-shot cocktail1 shot1 left shaker1 l2 l1)
   deleted: (clean shot1) (empty shot1) (shaker-level shaker1 l2)
   added: (contains shot1 cocktail1) (shaker-level shaker1 l1)
   goals met: 1 of 1
